// == task-5 == //
// Написати програму яка буде переводити температуру з цельсія
// в фаренгейти, або навпаки з фаренгейта в цельсії

// (Фаренгейт — 32) : 1,8 = Цельсий Пример: (50°F - 32) : 1,8 = 10°C
// Цельсий х 1,8 + 32 = Фаренгейт Пример: 10°C x 1,8 + 32 = 50°F

let temp = prompt(
  "Введите температуру (Цельсий - C, Фарингейт -  F), например: 50F"
);
let enteredTemp = Number.parseFloat(temp);
if (temp.includes("C")) {
  alert(`Температура по Фарингейту ${enteredTemp * 1.8 + 32}F`);
} else if (temp.includes("F")) {
  alert(`Температура по Цельсию ${(enteredTemp - 32) / 1.8}C`);
} else alert("😵");
